home/programs/editor/emacs/config.org
#+TITLE: Emacs Configuration

* early-init.el

** Garbage collection

#+begin_src emacs-lisp :tangle early-init.el
(setq gc-cons-threshold 100000000)
(setq garbage-collection-messages nil)

(setq package-enable-at-startup nil)
(setq load-prefer-newer t)
#+end_src

** Inhibit

#+begin_src emacs-lisp :tangle early-init.el
(setq inhibit-splash-screen t)
(setq frame-inhibit-implied-resize t)
(setq inhibit-compacting-font-caches t)
#+end_src

** I/O

#+begin_src emacs-lisp :tangle early-init.el
(when (boundp 'read-process-output-max)
  ;; 1MB in bytes, default 4096 bytes
  (setq read-process-output-max 1048576))
#+end_src

** Frame

#+begin_src emacs-lisp :tangle early-init.el
(push '(vertical-scroll-bars) default-frame-alist)
(push '(menu-bar-lines . 0) default-frame-alist)
(push '(tool-bar-lines . 0) default-frame-alist)
#+end_src

** Fonts

#+begin_src emacs-lisp :tangle early-init.el
(set-face-attribute 'default nil :family "0xProto" :height 140)
;; (set-face-attribute 'default nil :family "Explex" :height 14)0l
#+end_src

** Native compile

#+begin_src emacs-lisp :tangle early-init.el
;; see: https://apribase.net/2024/07/09/emacs-eln-cache/
(when (boundp 'native-comp-eln-load-path)
  ;; コンパイルしたバイナリの出力先を変更する
  (startup-redirect-eln-cache
   (expand-file-name "~/.local/share/emacs/eln-cache/")))

(with-eval-after-load 'comp
  (setopt native-comp-async-jobs-number 8
          native-comp-speed 3
          native-comp-always-compile t))

(with-eval-after-load 'warnings
  ;; native comp の warning を抑える
  (setopt warning-suppress-types '((comp))))
#+end_src

** LSP

#+begin_src emacs-lisp :tangle early-init.el
;; see: https://emacs-lsp.github.io/lsp-mode/page/performance/#use-plists-for-deserialization
(setenv "LSP_USE_PLISTS" "true")
#+end_src

* init.el

** Header

#+begin_src emacs-lisp :tangle init.el
;; init.el --- SuzumiyaAoba's init.el -*- lexical-binding: t; coding: utf-8 -*-
#+end_src

** Options

*** Debug

#+begin_src emacs-lisp
;; (setq debug-on-error t)
#+end_src

*** Profile

#+begin_src emacs-lisp :tangle init.el
(defconst my/loading-profile-p nil
  "If non-nil, use built-in profiler.el.")

(defconst my/enable-profile nil
  "If true, enable profile")
#+end_src

** Package manager

*** [[https://wikemacs.org/wiki/Package.el][package.el]]

#+begin_src emacs-lisp :tangle init.el
(with-eval-after-load 'package
  (setopt package-enable-at-startup nil))
#+end_src

*** [[https://github.com/progfolio/elpaca][elpaca]]

**** Install

#+begin_src emacs-lisp :tangle init.el
(defvar elpaca-installer-version 0.8)
(defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
(defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
(defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
(defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                              :ref nil :depth 1
                              :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                              :build (:not elpaca--activate-package)))
(let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
       (build (expand-file-name "elpaca/" elpaca-builds-directory))
       (order (cdr elpaca-order))
       (default-directory repo))
  (add-to-list 'load-path (if (file-exists-p build) build repo))
  (unless (file-exists-p repo)
    (make-directory repo t)
    (when (< emacs-major-version 28) (require 'subr-x))
    (condition-case-unless-debug err
        (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                  ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                  ,@(when-let* ((depth (plist-get order :depth)))
                                                      (list (format "--depth=%d" depth) "--no-single-branch"))
                                                  ,(plist-get order :repo) ,repo))))
                  ((zerop (call-process "git" nil buffer t "checkout"
                                        (or (plist-get order :ref) "--"))))
                  (emacs (concat invocation-directory invocation-name))
                  ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                        "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                  ((require 'elpaca))
                  ((elpaca-generate-autoloads "elpaca" repo)))
            (progn (message "%s" (buffer-string)) (kill-buffer buffer))
          (error "%s" (with-current-buffer buffer (buffer-string))))
      ((error) (warn "%s" err) (delete-directory repo 'recursive))))
  (unless (require 'elpaca-autoloads nil t)
    (require 'elpaca)
    (elpaca-generate-autoloads "elpaca" repo)
    (load "./elpaca-autoloads")))
(add-hook 'after-init-hook #'elpaca-process-queues)
(elpaca `(,@elpaca-order))
#+end_src

**** [[https://www.emacswiki.org/emacs/SetupEl][startup integration]]

#+begin_src emacs-lisp :tangle init.el
(elpaca setup (require 'setup))
(elpaca-wait)

(defun setup-wrap-to-install-package (body _name)
  "Wrap BODY in an `elpaca' block if necessary.
The body is wrapped in an `elpaca' block if `setup-attributes'
contains an alist with the key `elpaca'."
  (if (assq 'elpaca setup-attributes)
      `(elpaca ,(cdr (assq 'elpaca setup-attributes)) ,@(macroexp-unprogn body))
    body))

;; Add the wrapper function
(add-to-list 'setup-modifier-list #'setup-wrap-to-install-package)
(setup-define :elpaca
  (lambda (order &rest recipe)
    (push (cond
	   ((eq order t) `(elpaca . ,(setup-get 'feature)))
	   ((eq order nil) '(elpaca . nil))
	   (`(elpaca . (,order ,@recipe))))
	  setup-attributes)
    ;; If the macro wouldn't return nil, it would try to insert the result of
    ;; `push' which is the new value of the modified list. As this value usually
    ;; cannot be evaluated, it is better to return nil which the byte compiler
    ;; would optimize away anyway.
    nil)
  :documentation "Install ORDER with `elpaca'.
The ORDER can be used to deduce the feature context."
  :shorthand #'cadr)
#+end_src

**** Macro

#+begin_src emacs-lisp :tangle init.el
(setup-define :load-after
  (lambda (&rest features)
    (let ((body `(require ',(setup-get 'feature))))
      (dolist (feature (nreverse features))
        (setq body `(with-eval-after-load ',feature ,body)))
      body))
  :documentation "Load the current feature after FEATURES.")

(setup-define :opt
  (lambda (&rest pairs)
    `(setopt ,@pairs))
  :after-loaded t)
#+end_src

***** reference

+ [[https://apribase.net/2024/05/29/emacs-elpaca-setup-el/][Elpaca + setup.el でわかりやすく非同期にパッケージを管理する ||| Apribase]]

** Basic

#+begin_src emacs-lisp :tangle init.el
;; suppress warning
(setq warning-minimum-level :emergency)

;; disable magic file name
(defconst my/saved-file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)
#+end_src

*** OS

#+begin_src emacs-lisp :tangle init.el
;; is-darwin
(defconst is-darwin (string= system-type "darwin"))

;; is-darwin-window
(defconst is-darwin-window (and (string= system-type "darwin")
                                window-system))

;; when-darwin-not-window-system
(defconst is-darwin-not-window (and (string= system-type "darwin")
                                    (not window-system)))
#+end_src

