home/programs/editor/emacs/config.org
** Profile

#+begin_src emacs-lisp :tangle init.el
(when my/enable-profile
  (require 'profiler)
  (profiler-start 'cpu))

;; start profile
(defconst my/before-load-init-time (current-time))

;;;###autoload
(defun my/load-init-time ()
  "Loading time of user init files including time for `after-init-hook'."
  (let ((time1 (float-time
                (time-subtract after-init-time my/before-load-init-time)))
        (time2 (float-time
                (time-subtract (current-time) my/before-load-init-time))))
    (message (concat "Loading init files: %.0f [msec], "
                     "of which %.f [msec] for `after-init-hook'.")
             (* 1000 time1) (* 1000 (- time2 time1)))))
(add-hook 'after-init-hook #'my/load-init-time t)

(defvar my/tick-previous-time my/before-load-init-time)

;;;###autoload
(defun my/tick-init-time (msg)
  "Tick boot sequence at loading MSG."
  (when my/loading-profile-p
    (let ((ctime (current-time)))
      (message "---- %5.2f[ms] %s"
               (* 1000 (float-time
                        (time-subtract ctime my/tick-previous-time)))
               msg)
      (setq my/tick-previous-time ctime))))

(defun my/emacs-init-time ()
  "Emacs booting time in msec."
  (interactive)
  (message "Emacs booting time: %.0f [msec] = `emacs-init-time'."
           (* 1000
              (float-time (time-subtract
                           after-init-time
                           before-init-time)))))

(add-hook 'after-init-hook #'my/emacs-init-time)
#+end_src

** Native compile

#+begin_src emacs-lisp :tangle init.el
(with-eval-after-load 'comp
  (setq native-comp-async-jobs-number 8)
  (setq native-comp-speed 3)
  (setq native-comp-always-compile t)
  (setq native-comp-async-report-warnings-errors nil)
  (setq native-compile-prune-cache t)

  (defun my/native-comp-packages ()
    (interactive)
    (native-compile-async "~/.emacs.d/init.el")
    (native-compile-async "~/.emacs.d/early-init.el")
    (native-compile-async "~/.emacs.d/elpaca" 'recursively)))
#+end_src

** Basic behavior

#+begin_src emacs-lisp :tangle init.el
(setq make-backup-files nil)
(setq backup-inhibited nil)
(setq create-lockfiles nil)
(setq auto-save-default nil)
(setq delete-by-moving-to-trash t)
(setq vc-follow-symlinks t)
(setq ring-bell-function 'ignore)
(defalias 'yes-or-no-p 'y-or-n-p)
(setq inhibit-startup-message t)
(setq kill-whole-line t)

(setq-default indent-tabs-mode nil)
#+end_src

** Perfomance tips

#+begin_src emacs-lisp :tangle init.el
(setup simple
  (setq blink-matching-paren nil)
  (setq auto-mode-case-fold nil)
  (setq vc-handled-backends '(Git))
  (setq-default bidi-display-reordering 'left-to-right)
  (setq bidi-inhibit-bpa t)
  (setq-default cursor-in-non-selected-windows nil)
  (setq highlight-nonselected-windows nil)
  (setq fast-but-imprecise-scrolling t
        jit-lock-defer-time 0)
  (setq ffap-machine-p-known 'reject)
  (setq idle-update-delay 1.0)
  (setq redisplay-skip-fontification-on-input t)

  (:only-if is-darwin)
  (setq command-line-ns-option-alist nil))
#+end_src

** Languages & Encoding

#+begin_src emacs-lisp :tangle init.el
(setup simple
  (set-language-environment "Japanese")
  (prefer-coding-system 'utf-8)
  (set-default-coding-systems 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (set-file-name-coding-system 'utf-8)
  (set-clipboard-coding-system 'utf-8)
  (set-buffer-file-coding-system 'utf-8))
#+end_src

** Case ignore

#+begin_src emacs-lisp :tangle init.el
;; case ignore
(setq read-file-name-completion-ignore-case t)
(setq read-buffer-completion-ignore-case t)
(setq completion-ignore-case t)
#+end_src

** Copy & Paste

#+begin_src emacs-lisp :tangle init.el
;; copy & paste
(setup (:only-if is-darwin)
  (defun copy-from-osx ()
    (shell-command-to-string "pbpaste"))

  (defun paste-to-osx (text &optional push)
    (let ((process-connection-type nil))
      (let ((proc (start-process "pbcopy" "*Messages*" "pbcopy")))
        (process-send-string proc text)
        (process-send-eof proc))))

  (setq interprogram-cut-function 'paste-to-osx)
  (setq interprogram-paste-function 'copy-from-osx))
#+end_src

** Terminal

#+begin_src emacs-lisp :tangle init.el
(setup
  (:only-if is-darwin-not-window)
  (set-face-attribute 'vertical-border nil :foreground "gray")
  (set-display-table-slot standard-display-table 'vertical-border (make-glyph-code ?\u2502)))

(setup xterm-mouse-mode
  (:only-if is-darwin-not-window)
  (xterm-mouse-mode t))

(setup mouse-wheel-mode
  (:only-if is-darwin-not-window)
  (mouse-wheel-mode t))
#+end_src

** Theme

#+begin_src emacs-lisp :tangle init.el
(setup modus-themes
  (:elpaca t)
  (:opt modus-themes-italic-constructs t
        modus-themes-bold-constructs t
        modus-themes-region '(bg-only no-extend)
        modus-themes-mixed-fonts t
        modus-themes-subtle-line-numbers t
        modus-themes-org-blocks 'gray-background
        modus-themes-common-palette-overrides
	'(
          (comment yellow-cooler)
          ;; (comment yellow-warmer)
          ;; (string green-cooler)
          (string green-warmer)
          ;; (keyword cyan-cooler)
          ))
  (load-theme 'modus-vivendi t))
#+end_src

** Icons

*** nerd-icons-corfu

#+begin_src emacs-lisp :tangle init.el
(setup nerd-icons-corfu
  (:elpaca t)
  (:load-after corfu)
  (:when-loaded
    (add-to-list 'corfu-margin-formatters #'nerd-icons-corfu-formatter)))
#+end_src


*** nerd-icons-completion

#+begin_src emacs-lisp :tangle init.el
(setup nerd-icons-completion
  (:elpaca t)
  (:load-after marginalia)
  (:when-loaded
    (add-hook 'marginalia-mode-hook #'nerd-icons-completion-marginalia-setup)
    (nerd-icons-completion-mode)))
#+end_src

*** nerd-icons-dired

#+begin_src emacs-lisp :tangle init.el
(setup nerd-icons-dired
  (:elpaca t)
  (:with-mode dired-mode
    (:hook nerd-icons-dired-mode))
  (:when-loaded
    (diminish 'nerd-icons-dired-mode)))
#+end_src

*** treemacs-nerd-icons

#+begin_src emacs-lisp :tangle init.el
(setup treemacs-nerd-icons
  (:elpaca t)
  (require 'treemacs-nerd-icons)
  (treemacs-load-theme "nerd-icons"))
#+end_src

** moody

#+begin_src emacs-lisp :tangle init.el
(setup moody
  (:elpaca t)
  (require 'moody)
  (moody-replace-mode-line-front-space)
  (moody-replace-mode-line-buffer-identification)
  (moody-replace-vc-mode))
#+end_src

** Scroll

#+begin_src emacs-lisp :tangle init.el
(setup simple
  (setq scroll-margin 0)
  (setq scroll-conservatively 100000)
  (setq scroll-preserve-screen-position t))

(setup pixel-scroll-precision-mode
  (:only-if is-darwin-window)
  (pixel-scroll-precision-mode t))
#+end_src

*** fast-scroll

see: https://github.com/meatcar/emacs.d?tab=readme-ov-file#fast-scroll

#+begin_src emacs-lisp :tangle init.el
(setup fast-scroll
  (:elpaca t)
  (:when-loaded
    (fastscroll-config)
    (fastscroll-mode 1)))
#+end_src

** [[https://github.com/emacsmirror/diminish][diminish]]

#+begin_src emacs-lisp :tangle init.el
(setup diminish
  (:elpaca t))
#+end_src

** display-line-numbers

#+begin_src emacs-lisp :tangle init.el
(setup display-line-numbers
  (:opt display-line-numbers-grow-only t)
  (:with-mode prog-mode
    (:hook display-line-numbers-mode))
  (:with-mode text-mode
    (:hook display-line-numbers-mode)))
#+end_src

** eldoc

#+begin_src emacs-lisp :tangle init.el
(setup eldoc
  (:elpaca t)
  (:opt eldoc-echo-area-use-multiline-p nil)
  (:global
   "C-c q" toggle-eldoc-doc-buffer)
  (:when-loaded
    (diminish 'eldoc-mode))

  (defun get-buffer-by-regex (regex)
    (car (seq-filter (lambda (buf)
                       (string-match-p regex (buffer-name buf)))
                     (buffer-list))))

  (seq-filter (lambda (buf)
                (string-match-p "^*scratch" (buffer-name buf)))
              (buffer-list))

  (setq eldoc-buffer-regex "^\\*eldoc\\( for [^*]+\\)\?\\*")

  (add-to-list 'display-buffer-alist
               `(,eldoc-buffer-regex                 
                 display-buffer-at-bottom
                 (window-height . 20)))

  (defun my/eldoc-doc-buffer-active ()
    (let* ((buffer (get-buffer-by-regex eldoc-buffer-regex))
           (window (get-buffer-window buffer)))
      (when window
        (select-window window))))
  (add-hook 'window-configuration-change-hook 'my/eldoc-doc-buffer-active)

  (defun toggle-eldoc-doc-buffer (&optional interactive)
    "Toggle the display of the eldoc documentation buffer."
    (interactive '(t))
    (let ((buffer (get-buffer-by-regex eldoc-buffer-regex)))
      (if (and buffer (get-buffer-window buffer))
          (delete-window (get-buffer-window buffer))
        (eldoc-print-current-symbol-info interactive)))))
#+end_src

** [[https://github.com/tarsius/keycast][keycast]]

#+begin_src emacs-lisp :tangle init.el
(setup keycast
  (:elpaca t)
  (keycast-tab-bar-mode))
#+end_src

** [[https://github.com/emacsmirror/form-feed][form-feed]]

#+begin_src emacs-lisp :tangle init.el
(setup form-feed
  (:elpaca t)
  (:with-mode emacs-lisp-mode
    (:hook form-feed-mode))
  (:when-loaded
    (diminish 'form-feed-mode)))
#+end_src

** [[https://github.com/abo-abo/ace-window][ace-window]]

#+begin_src emacs-lisp :tangle init.el
(setup ace-window
  (:elpaca t)
  (:global "C-x o" ace-window)
  (:opt aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))
#+end_src

** Search

*** [[https://github.com/emacsorphanage/anzu][anzu]]

#+begin_src emacs-lisp :tangle init.el
;; anzu
(setup anzu
  (:elpaca t)
  (:global [remap query-replace] anzu-query-replace
           [remap query-replace-regexp] anzu-query-replace-regex)
  (:opt anzu-replace-threshold 1000
        anzu-search-threshold 1000)
  (:with-mode emacs-startup
    (:hook global-anzu-mode))
  (:when-loaded
    (diminish 'anzu-mode))
  (copy-face 'mode-line 'anzu-mode-line))
#+end_src

*** ripgrep

#+begin_src emacs-lisp :tangle init.el
(setup ripgrep
  (:elpaca t))
#+end_src

** [[https://github.com/abo-abo/avy][avy]]

#+begin_src emacs-lisp :tangle init.el
(setup avy
  (:elpaca t)
  (:global "M-g M-g" 'avy-goto-char))
#+end_src

** auto-revert-mode

#+begin_src emacs-lisp :tangle init.el
(setup auto-revert-mode
  (global-auto-revert-mode t))
#+end_src

** recentf-mode

#+begin_src emacs-lisp :tangle init.el
(setup recentf-mode
  (:opt recentf-max-saved-items 100)
  (recentf-mode +1))
#+end_src

** savehist-mode

#+begin_src emacs-lisp :tangle init.el
(with-eval-after-load 'savehist-mode
  (savehist-mode +1))
#+end_src

** Undo & Redo

*** undo-tree

#+begin_src emacs-lisp :tangle init.el
(setup undo-tree
  (:elpaca t)
  (:opt undo-tree-auto-save-history nil)
  (:when-loaded
    (diminish 'undo-tree-mode))
  (global-undo-tree-mode t))
#+end_src

*** undohist

#+begin_src emacs-lisp :tangle init.el
(setup undohist
  (:elpaca t)
  (:when-loaded
    (diminish 'undohist-mode))
  (undohist-initialize))
#+end_src

** IME

