home/base/editor/emacs/init.el
  (require 'profiler)
  (profiler-start 'cpu))

;; disable magic file name
(defconst my/saved-file-name-handler-alist file-name-handler-alist)
(setq file-name-handler-alist nil)

;; start profile
(defconst my/before-load-init-time (current-time))

;;;###autoload
(defun my/load-init-time ()
  "Loading time of user init files including time for `after-init-hook'."
  (let ((time1 (float-time
                (time-subtract after-init-time my/before-load-init-time)))
        (time2 (float-time
                (time-subtract (current-time) my/before-load-init-time))))
    (message (concat "Loading init files: %.0f [msec], "
                     "of which %.f [msec] for `after-init-hook'.")
             (* 1000 time1) (* 1000 (- time2 time1)))))
(add-hook 'after-init-hook #'my/load-init-time t)

(defvar my/tick-previous-time my/before-load-init-time)

;;;###autoload
(defun my/tick-init-time (msg)
  "Tick boot sequence at loading MSG."
  (when my/loading-profile-p
    (let ((ctime (current-time)))
      (message "---- %5.2f[ms] %s"
               (* 1000 (float-time
                        (time-subtract ctime my/tick-previous-time)))
               msg)
      (setq my/tick-previous-time ctime))))

(defun my/emacs-init-time ()
  "Emacs booting time in msec."
  (interactive)
  (message "Emacs booting time: %.0f [msec] = `emacs-init-time'."
           (* 1000
              (float-time (time-subtract
                           after-init-time
                           before-init-time)))))

(add-hook 'after-init-hook #'my/emacs-init-time)

(with-eval-after-load 'comp
  (setq native-comp-async-jobs-number 8)
  (setq native-comp-speed 3)
  (setq native-comp-async-report-warnings-errors nil)
  (setq native-compile-prune-cache t))

(setq make-backup-files nil)
(setq backup-inhibited nil)
(setq create-lockfiles nil)
(setq auto-save-default nil)
(setq delete-by-moving-to-trash t)
(setq vc-follow-symlinks t)
(setq ring-bell-function 'ignore)
(defalias 'yes-or-no-p 'y-or-n-p)
(setq inhibit-startup-message t)

;; improve performance tips
(setup simple
  (setq blink-matching-paren nil)
  (setq auto-mode-case-fold nil)
  (setq vc-handled-backends '(Git))
  (setq-default bidi-display-reordering 'left-to-right)
  (setq bidi-inhibit-bpa t)
  (setq-default cursor-in-non-selected-windows nil)
  (setq highlight-nonselected-windows nil)
  (setq fast-but-imprecise-scrolling t)
  (setq ffap-machine-p-known 'reject)
  (setq idle-update-delay 1.0)
  (setq redisplay-skip-fontification-on-input t)
  (:only-if is-darwin)
  (setq command-line-ns-option-alist nil))

(setup simple
  (set-language-environment "Japanese")
  (prefer-coding-system 'utf-8)
  (set-default 'buffer-file-coding-system 'utf-8))

;; enable magic file name
(setq file-name-handler-alist my/saved-file-name-handler-alist)

;; indent
(setq-default indent-tabs-mode nil)

;; case ignore
(setq read-file-name-completion-ignore-case t)
(setq read-buffer-completion-ignore-case t)
(setq completion-ignore-case t)

;; copy & paste
(setup (:only-if is-darwin)
  (defun copy-from-osx ()
    (shell-command-to-string "pbpaste"))

  (defun paste-to-osx (text &optional push)
    (let ((process-connection-type nil))
      (let ((proc (start-process "pbcopy" "*Messages*" "pbcopy")))
        (process-send-string proc text)
        (process-send-eof proc))))

  (setq interprogram-cut-function 'paste-to-osx)
  (setq interprogram-paste-function 'copy-from-osx))

(setup simple
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (menu-bar-mode -1))

;; auto-revert-mode
(setup auto-revert-mode
  (global-auto-revert-mode t))

;; native compile
(setup comp
  (:opt native-comp-async-jobs-number 8
        native-comp-speed 2
        native-comp-always-compile t))

;; theme
(setup modus-themes
  (:elpaca t)
  (:opt modus-themes-italic-constructs t
        modus-themes-bold-constructs t
        modus-themes-region '(bg-only no-extend)
        modus-themes-mixed-fonts t
        modus-themes-subtle-line-numbers t
        modus-themes-org-blocks 'gray-background
        modus-themes-common-palette-overrides
	'(
          (comment yellow-cooler)
          ;; (comment yellow-warmer)
          ;; (string green-cooler)
          (string green-warmer)
          ;; (keyword cyan-cooler)
          ))
  (load-theme 'modus-vivendi-tinted t))

;; ace-window
(setup ace-window
  (:elpaca t)
  (:global "C-x o" ace-window)
  (:opt aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l)))

;; anzu
(setup anzu
  (:elpaca t)
  (:global [remap query-replace] anzu-query-replace
           [remap query-replace-regexp] anzu-query-replace-regex)
  (:opt anzu-replace-threshold 1000
        anzu-search-threshold 1000)
  (:with-mode emacs-startup
    (:hook global-anzu-mode))
  (:when-loaded
    (diminish 'anzu-mode))
  (copy-face 'mode-line 'anzu-mode-line))

;; avy
(setup avy
  (:elpaca t)
  (:global "M-g M-g" 'avy-goto-char))

;; consult
(setup consult
  (:elpaca t)
